Infineon/mbedtls-optiga-trust-m/example_tls_client_xmc/xmc4800_iot_kit/common/aws_tcp_echo_client_single_task.c
    /* This task can be created a number of times.  Each instance is numbered
     * to enable each instance to use a different Rx and Tx buffer.  The number is
     * passed in as the task's parameter. */
    xInstance = ( BaseType_t ) pvParameters;

    /* Point to the buffers to be used by this instance of this task. */
    pcTransmittedString = &( cTxBuffers[ xInstance ][ 0 ] );
    pcReceivedString = &( cRxBuffers[ xInstance ][ 0 ] );

#if defined(TLS_SECRET_IN_TRUSTM)
#if ( ENABLE_TRUSTM == 1 )
	optiga_lib_status_t open_app_status = trustm_OpenApp();
	if (open_app_status != OPTIGA_LIB_SUCCESS)
	{
		configPRINTF( ( "TCPCLient(): Error: Open TrustM App failed. status=0x%x\r\n",open_app_status) );
		goto cleanup;
	}else
	{
		configPRINTF( ( "TCPCLient(): Open TrustM App Ok\r\n") );
	}
	configPRINTF( ( "TCPCLient(): Pairing of host and OPTIGA \r\n") );
	//example_pair_host_and_optiga_using_pre_shared_secret();

#if ( READ_UID_TEST == 1 )
	do{
		configPRINTF( ( "+++++Read UID Test:+++++\r\n") );
		example_optiga_util_read_uid();
		configPRINTF( ( "Read UID done count=%d\r\n",TRUSTM_UID_LOOP_COUNT-- ) );
	}while(TRUSTM_UID_LOOP_COUNT);
	configPRINTF( ( "+++++Read UID Test Completed+++++\r\n") );
#endif

#if ( AUTH_TEST == 1 )
	do{
		configPRINTF( ( "+++++Authentication Test+++++\r\n") );
		example_authenticate_chip();
		configPRINTF( ( "Auth done count=%d\r\n",TRUSTM_AUTH_LOOP_COUNT-- ) );
	}while(TRUSTM_AUTH_LOOP_COUNT);
	configPRINTF( ( "+++++Auth Test Completed+++++\r\n") );
#endif

#if (EXAMPLE_UNIT_TESTS==1)
	    do
	    {
	    	configPRINTF( ( "+++++Unit Tests+++++\r\n") );
			example_optiga_crypt_ecc_generate_keypair();
			example_optiga_crypt_ecdsa_sign();
			example_optiga_crypt_ecdsa_verify();
			example_optiga_crypt_hash();
			example_optiga_crypt_random();

			example_optiga_crypt_rsa_encrypt_message();

			example_optiga_crypt_rsa_generate_keypair();
			example_optiga_crypt_rsa_sign();
			example_optiga_crypt_rsa_verify();
			example_optiga_util_protected_update();
			example_optiga_util_read_data();
			example_optiga_util_update_count();
			example_optiga_util_write_data();
			example_optiga_crypt_tls_prf_sha256();
			example_optiga_crypt_ecdh();
			example_optiga_crypt_rsa_encrypt_session();
			example_optiga_crypt_rsa_decrypt_and_export();

			configPRINTF( ( "Example unit tests loop count=%d\r\n",TRUSTM_UNIT_TEST_LOOP_COUNT--) );
	    }while(TRUSTM_UNIT_TEST_LOOP_COUNT);
	    configPRINTF( ( "+++++Unit Tests Completed+++++\r\n") );
#endif

#if (TRUSTM_RSA_TEST == 1)
	do{
		configPRINTF( ( "+++++TrustM pre shared secret Test+++++\r\n") );
	    example_pair_host_and_optiga_using_pre_shared_secret();
		configPRINTF( ( "+++++TrustM pre shared secret Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Verify Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_verify();
		configPRINTF( ( "+++++TrustM RSA Verify Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Sign Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_sign();
		configPRINTF( ( "+++++TrustM RSA Sign Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Encrypt Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_encrypt();
		configPRINTF( ( "+++++TrustM RSA Encrypt Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Decrypt Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_decrypt();
		configPRINTF( ( "+++++TrustM RSA Decrypt Test Completed+++++\r\n") );
	} while(FALSE);

#endif

#if (TRUSTM_ECC_EXTENDED_TEST == 1)
	do{
		mbedtls_threading_set_alt( aws_mbedtls_mutex_init,
		                                   aws_mbedtls_mutex_free,
		                                   aws_mbedtls_mutex_lock,
		                                   aws_mbedtls_mutex_unlock );

		configPRINTF( ( "ECC Extended curve examples\r\n") );
		if(0 != example_mbedtls_optiga_crypt_ecc_extendedcurve_genkeypair())
		{
			configPRINTF( ( "Genkey pair example test failed\n") );
			break;
		}

		configPRINTF( ( "ECC Extended curve Genkey pair example executed successfully\r\n") );

		if(0 != example_mbedtls_optiga_crypt_ecc_extendedcurve_calsign())
		{
			configPRINTF( ( "CalSign example test failed\n") );
			break;
		}

		configPRINTF( ( "ECC Extended curve CalSign examples executed successfully\r\n") );

		if(0 != example_mbedtls_optiga_crypt_ecc_extendedcurve_verify())
		{
			configPRINTF( ( "VerifySign example test failed\n") );
			break;
		}

		configPRINTF( ( "ECC Extended curve VerifySign examples executed successfully\r\n") );

		if(0 != example_mbedtls_optiga_crypt_ecc_extendedcurve_calcssec())
		{
			configPRINTF( ( "CalSSec example test failed\n") );
			break;
		}

		configPRINTF( ( "ECC Extended curve CalSSec examples executed successfully\n") );

		configPRINTF( ( "ECC Extended curve example successful\n") );

	} while(FALSE);

#endif

#endif
#endif


    /* Echo requests are sent to the echo server.  The address of the echo
     * server is configured by the constants configECHO_SERVER_ADDR0 to
     * configECHO_SERVER_ADDR3 in FreeRTOSConfig.h. */
    xEchoServerAddress.usPort = SOCKETS_htons( echoECHO_PORT );
    xEchoServerAddress.ulAddress = SOCKETS_inet_addr_quick( configECHO_SERVER_ADDR0,
                                                            configECHO_SERVER_ADDR1,
                                                            configECHO_SERVER_ADDR2,
                                                            configECHO_SERVER_ADDR3 );


    for( int i=0; i<CONNECT_COUNT;i++ )
    {
    	 configPRINTF( ( "================= TCP Client Connect count=%d ===================\r\n", i ) );

        /* Create a TCP socket. */
        xSocket = SOCKETS_Socket( SOCKETS_AF_INET, SOCKETS_SOCK_STREAM, SOCKETS_IPPROTO_TCP );
        configASSERT( xSocket != SOCKETS_INVALID_SOCKET );

        /* Set a time out so a missing reply does not cause the task to block
         * indefinitely. */
        SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
        SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_SNDTIMEO, &xSendTimeOut, sizeof( xSendTimeOut ) );

        #if ( ipconfigUSE_TCP_WIN == 1 )
            {
                /* Set the window and buffer sizes. */
                SOCKETS_SetSockOpt( xSocket, 0, FREERTOS_SO_WIN_PROPERTIES, ( void * ) &xWinProps, sizeof( xWinProps ) );
            }
        #endif /* ipconfigUSE_TCP_WIN */

        #if ( configTCP_ECHO_TASKS_SINGLE_TASK_TLS_ENABLED == 1 )
            {
                /* Set the socket to use TLS. */
                SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_REQUIRE_TLS, NULL, ( size_t ) 0 );
                SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_TRUSTED_SERVER_CERTIFICATE, cTlsECHO_SERVER_CERTIFICATE_PEM, ulTlsECHO_SERVER_CERTIFICATE_LENGTH );
            }
        #endif /* configTCP_ECHO_TASKS_SINGLE_TASK_TLS_ENABLED */

        /* Connect to the echo server. */
        configPRINTF( ( "Connecting to echo server port=%d\r\n", echoECHO_PORT ) );

